Revit 2026 API

# ExtElemChangeBeamSectionRegistry Properties

---

The ExtElemChangeBeamSectionRegistry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

ExtElemChangeBeamSectionRegistry Class

Autodesk.Revit.DB.Structure Namespace